Revit 2026 API

# Transform1D Class

---

An affine transform of 1D Euclidean space.

SystemObject Autodesk.Revit.DBTransform1D

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Transform1D : IDisposable
```
```vb
Public Class Transform1D
	Implements IDisposable
```
```cpp
public ref class Transform1D : IDisposable
```
```fsharp
type Transform1D =
    class
        interface IDisposable
    end
```

The Transform1D type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Transform1D(Double) | Constructs the transformation by specifying the scale only. |
|  | Transform1D(Transform1D) | The copy constructor. |
|  | Transform1D(Double, Double) | Constructs the transformation by specifying the scale and the translation. |

|  | Name | Description |
| --- | --- | --- |
|  | Determinant | The determinant of this transformation. |
|  | IsIdentity | The boolean value that indicates whether this transformation is an identity. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Scale | The real number that represents the scale of this transformation. |
|  | Translation | The translational part of this transformation. |

|  | Name | Description |
| --- | --- | --- |
|  | AlmostEqual | Determines whether this transformation and the specified transformation are the same within the tolerance (1.0e-09). |
|  | Assign | Assigns values from the input transformation to this transformation. |
|  | Dispose | Releases all resources used by the Transform1D |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetInverse | Gets the inverse transformation of this transformation. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Multiply | Multiplies this transformation by the specified transformation and returns the result. |
|  | OfPoint | Applies the transformation to the 1-dimensional point and returns the result. |
|  | OfVector | Applies the transformation to the 1-dimensional vector (a "tangent vector" on the real line) and returns the result. |
|  | SetToIdentity | Set this TrfUV to the identity transform |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | TransformParameterDomain | Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly. |

An affine transform is a linear transform plus a translation (which may be zero). 1D space is tranformed according to the following formula: t -> A*t + B where A and B are constants. Some functions only accept certain kinds of transform (e.g., rigid motion, conformal, non-singular, etc.).

#### Reference

Autodesk.Revit.DB Namespace